Public Attributes | List of all members
API_MonolithPartsVisibilityData Struct Reference
Element Manager API
Describes which types of monolith parts are visible. More...
#include <APIdefs_Elements.h>
 Public Attributes
bool  | connectionVisible
Connection visibility settings.
bool  | drainingVisible
Draining visibility settings.
bool  | landingLineVisible
Landing line visibility settings.
bool  | structureGoingVisible
Structure going visibility settings.
bool  | structureGoingNosingVisible
Structure going nosing visibility settings.
Detailed Description
Describes which types of monolith parts are visible.
Member Data Documentation
◆ connectionVisible
 API_MonolithPartsVisibilityData::connectionVisible
Connection visibility settings.
◆ drainingVisible
 API_MonolithPartsVisibilityData::drainingVisible
Draining visibility settings.
◆ landingLineVisible
 API_MonolithPartsVisibilityData::landingLineVisible
Landing line visibility settings.
◆ structureGoingNosingVisible
 API_MonolithPartsVisibilityData::structureGoingNosingVisible
Structure going nosing visibility settings.
◆ structureGoingVisible
 API_MonolithPartsVisibilityData::structureGoingVisible
Structure going visibility settings.